Revit 2027 API
ExternalServices.BuiltInExternalServices.MemberForcesService Property
 The external service supporting view and modification of the member forces in analytical elements. The service is still under development and cannot be used. It means that no server can be external registered from it yet.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId MemberForcesService { get; }
Public Shared ReadOnly Property MemberForcesService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ MemberForcesService {
	ExternalServiceId^ get ();
}
static member MemberForcesService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace